7767517
242 291
Input                    data                     0 1 data
Convolution              conv_0                   1 1 data 1 0=16 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=432
Swish                    silu_85                  1 1 1 2
Convolution              conv_1                   1 1 2 3 0=32 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=4608
Swish                    silu_86                  1 1 3 4
Convolution              conv_2                   1 1 4 5 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1024
Swish                    silu_87                  1 1 5 6
Slice                    split_0                  1 2 6 7 8 -23300=2,16,16 1=0
Split                    splitncnn_0              1 3 8 9 10 11
Convolution              conv_3                   1 1 11 12 0=16 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=2304
Swish                    silu_88                  1 1 12 13
Convolution              conv_4                   1 1 13 14 0=16 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=2304
Split                    splitncnn_1              1 2 14 15 16
Sigmoid                  sigmoid_78               1 1 16 17
BinaryOp                 mul_0                    2 1 15 17 18 0=2
BinaryOp                 add_1                    2 1 10 18 19 0=0
Concat                   cat_0                    3 1 7 9 19 20 0=0
Convolution              conv_5                   1 1 20 21 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1536
Swish                    silu_89                  1 1 21 22
Convolution              conv_6                   1 1 22 23 0=64 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=18432
Swish                    silu_90                  1 1 23 24
Convolution              conv_7                   1 1 24 25 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
Swish                    silu_91                  1 1 25 26
Slice                    split_1                  1 2 26 27 28 -23300=2,32,32 1=0
Split                    splitncnn_2              1 3 28 29 30 31
Convolution              conv_8                   1 1 31 32 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216
Swish                    silu_92                  1 1 32 33
Convolution              conv_9                   1 1 33 34 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216
Split                    splitncnn_3              1 2 34 35 36
Sigmoid                  sigmoid_79               1 1 36 37
BinaryOp                 mul_2                    2 1 35 37 38 0=2
BinaryOp                 add_3                    2 1 30 38 39 0=0
Split                    splitncnn_4              1 3 39 40 41 42
Convolution              conv_10                  1 1 42 43 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216
Swish                    silu_93                  1 1 43 44
Convolution              conv_11                  1 1 44 45 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216
Split                    splitncnn_5              1 2 45 46 47
Sigmoid                  sigmoid_80               1 1 47 48
BinaryOp                 mul_4                    2 1 46 48 49 0=2
BinaryOp                 add_5                    2 1 41 49 50 0=0
Concat                   cat_1                    4 1 27 29 40 50 51 0=0
Convolution              conv_12                  1 1 51 52 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=8192
Swish                    silu_94                  1 1 52 53
Split                    splitncnn_6              1 2 53 54 55
Convolution              conv_13                  1 1 55 56 0=128 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=73728
Swish                    silu_95                  1 1 56 57
Convolution              conv_14                  1 1 57 58 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384
Swish                    silu_96                  1 1 58 59
Slice                    split_2                  1 2 59 60 61 -23300=2,64,64 1=0
Split                    splitncnn_7              1 3 61 62 63 64
Convolution              conv_15                  1 1 64 65 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_97                  1 1 65 66
Convolution              conv_16                  1 1 66 67 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Split                    splitncnn_8              1 2 67 68 69
Sigmoid                  sigmoid_81               1 1 69 70
BinaryOp                 mul_6                    2 1 68 70 71 0=2
BinaryOp                 add_7                    2 1 63 71 72 0=0
Split                    splitncnn_9              1 3 72 73 74 75
Convolution              conv_17                  1 1 75 76 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_98                  1 1 76 77
Convolution              conv_18                  1 1 77 78 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Split                    splitncnn_10             1 2 78 79 80
Sigmoid                  sigmoid_82               1 1 80 81
BinaryOp                 mul_8                    2 1 79 81 82 0=2
BinaryOp                 add_9                    2 1 74 82 83 0=0
Concat                   cat_2                    4 1 60 62 73 83 84 0=0
Convolution              conv_19                  1 1 84 85 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768
Swish                    silu_99                  1 1 85 86
Split                    splitncnn_11             1 2 86 87 88
Convolution              conv_20                  1 1 88 89 0=256 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=294912
Swish                    silu_100                 1 1 89 90
Convolution              conv_21                  1 1 90 91 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536
Swish                    silu_101                 1 1 91 92
Slice                    split_3                  1 2 92 93 94 -23300=2,128,128 1=0
Split                    splitncnn_12             1 3 94 95 96 97
Convolution              conv_22                  1 1 97 98 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Swish                    silu_102                 1 1 98 99
Convolution              conv_23                  1 1 99 100 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Split                    splitncnn_13             1 2 100 101 102
Sigmoid                  sigmoid_83               1 1 102 103
BinaryOp                 mul_10                   2 1 101 103 104 0=2
BinaryOp                 add_11                   2 1 96 104 105 0=0
Concat                   cat_3                    3 1 93 95 105 106 0=0
Convolution              conv_24                  1 1 106 107 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=98304
Swish                    silu_103                 1 1 107 108
Convolution              conv_25                  1 1 108 109 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768
Swish                    silu_104                 1 1 109 110
Split                    splitncnn_14             1 2 110 111 112
Pooling                  maxpool2d_75             1 1 112 113 0=0 1=5 11=5 12=1 13=2 2=1 3=2 5=1
Split                    splitncnn_15             1 2 113 114 115
Pooling                  maxpool2d_76             1 1 115 116 0=0 1=5 11=5 12=1 13=2 2=1 3=2 5=1
Split                    splitncnn_16             1 2 116 117 118
Pooling                  maxpool2d_77             1 1 118 119 0=0 1=5 11=5 12=1 13=2 2=1 3=2 5=1
Concat                   cat_4                    4 1 111 114 117 119 120 0=0
Convolution              conv_26                  1 1 120 121 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=131072
Swish                    silu_105                 1 1 121 122
Split                    splitncnn_17             1 2 122 123 124
Interp                   interpolate_73           1 1 124 125 0=1 1=2.0 2=2.0 6=0
Concat                   cat_5                    2 1 125 87 126 0=0
Convolution              conv_27                  1 1 126 127 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=49152
Swish                    silu_106                 1 1 127 128
Slice                    split_4                  1 2 128 129 130 -23300=2,64,64 1=0
Split                    splitncnn_18             1 2 130 131 132
Convolution              conv_28                  1 1 132 133 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_107                 1 1 133 134
Convolution              conv_29                  1 1 134 135 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_108                 1 1 135 136
Concat                   cat_6                    3 1 129 131 136 137 0=0
Convolution              conv_30                  1 1 137 138 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=24576
Swish                    silu_109                 1 1 138 139
Split                    splitncnn_19             1 2 139 140 141
Interp                   interpolate_74           1 1 141 142 0=1 1=2.0 2=2.0 6=0
Concat                   cat_7                    2 1 142 54 143 0=0
Convolution              conv_31                  1 1 143 144 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=12288
Swish                    silu_110                 1 1 144 145
Slice                    split_5                  1 2 145 146 147 -23300=2,32,32 1=0
Split                    splitncnn_20             1 2 147 148 149
Convolution              conv_32                  1 1 149 150 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216
Swish                    silu_111                 1 1 150 151
Convolution              conv_33                  1 1 151 152 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216
Swish                    silu_112                 1 1 152 153
Concat                   cat_8                    3 1 146 148 153 154 0=0
Convolution              conv_34                  1 1 154 155 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=6144
Swish                    silu_113                 1 1 155 156
Split                    splitncnn_21             1 4 156 157 158 159 160
Convolution              conv_35                  1 1 160 161 0=64 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=36864
Convolution              conv_36                  1 1 159 162 0=16 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216
Convolution              conv_37                  1 1 158 163 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Convolution              conv_38                  1 1 157 164 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_114                 1 1 161 165
Swish                    silu_115                 1 1 162 166
Swish                    silu_116                 1 1 163 167
Swish                    silu_117                 1 1 164 168
Concat                   cat_9                    2 1 165 140 169 0=0
Convolution              conv_39                  1 1 166 170 0=16 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=2304
Convolution              conv_40                  1 1 167 171 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Convolution              conv_41                  1 1 168 172 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Convolution              conv_42                  1 1 169 173 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=24576
Swish                    silu_118                 1 1 170 174
Swish                    silu_119                 1 1 171 175
Swish                    silu_120                 1 1 172 176
Swish                    silu_121                 1 1 173 177
Convolution              conv_43                  1 1 174 178 0=16 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=256
Convolution              conv_44                  1 1 175 179 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
Convolution              conv_45                  1 1 176 180 0=1 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=64
Slice                    split_6                  1 2 177 181 182 -23300=2,64,64 1=0
Split                    splitncnn_22             1 2 182 183 184
Reshape                  reshape_144              1 1 178 185 0=6400 1=16
Concat                   cat_10                   2 1 179 180 186 0=0
Convolution              conv_46                  1 1 184 187 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Reshape                  reshape_145              1 1 186 188 0=6400 1=65
Swish                    silu_122                 1 1 187 189
Convolution              conv_47                  1 1 189 190 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_123                 1 1 190 191
Concat                   cat_11                   3 1 181 183 191 192 0=0
Convolution              conv_48                  1 1 192 193 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=24576
Swish                    silu_124                 1 1 193 194
Split                    splitncnn_23             1 4 194 195 196 197 198
Convolution              conv_49                  1 1 198 199 0=128 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=147456
Convolution              conv_50                  1 1 197 200 0=16 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=18432
Convolution              conv_51                  1 1 196 201 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=73728
Convolution              conv_52                  1 1 195 202 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=73728
Swish                    silu_125                 1 1 199 203
Swish                    silu_126                 1 1 200 204
Swish                    silu_127                 1 1 201 205
Swish                    silu_128                 1 1 202 206
Concat                   cat_12                   2 1 203 123 207 0=0
Convolution              conv_53                  1 1 204 208 0=16 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=2304
Convolution              conv_54                  1 1 205 209 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Convolution              conv_55                  1 1 206 210 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Convolution              conv_56                  1 1 207 211 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=98304
Swish                    silu_129                 1 1 208 212
Swish                    silu_130                 1 1 209 213
Swish                    silu_131                 1 1 210 214
Swish                    silu_132                 1 1 211 215
Convolution              conv_57                  1 1 212 216 0=16 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=256
Convolution              conv_58                  1 1 213 217 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
Convolution              conv_59                  1 1 214 218 0=1 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=64
Slice                    split_7                  1 2 215 219 220 -23300=2,128,128 1=0
Split                    splitncnn_24             1 2 220 221 222
Reshape                  reshape_146              1 1 216 223 0=1600 1=16
Concat                   cat_13                   2 1 217 218 224 0=0
Convolution              conv_60                  1 1 222 225 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Reshape                  reshape_147              1 1 224 226 0=1600 1=65
Swish                    silu_133                 1 1 225 227
Convolution              conv_61                  1 1 227 228 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Swish                    silu_134                 1 1 228 229
Concat                   cat_14                   3 1 219 221 229 230 0=0
Convolution              conv_62                  1 1 230 231 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=98304
Swish                    silu_135                 1 1 231 232
Split                    splitncnn_25             1 3 232 233 234 235
Convolution              conv_63                  1 1 235 236 0=16 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Convolution              conv_64                  1 1 234 237 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Convolution              conv_65                  1 1 233 238 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Swish                    silu_136                 1 1 236 239
Swish                    silu_137                 1 1 237 240
Swish                    silu_138                 1 1 238 241
Convolution              conv_66                  1 1 239 242 0=16 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=2304
Convolution              conv_67                  1 1 240 243 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Convolution              conv_68                  1 1 241 244 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_139                 1 1 242 245
Swish                    silu_140                 1 1 243 246
Swish                    silu_141                 1 1 244 247
Convolution              conv_69                  1 1 245 248 0=16 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=256
Convolution              conv_70                  1 1 246 249 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
Convolution              conv_71                  1 1 247 250 0=1 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=64
Reshape                  reshape_148              1 1 248 251 0=400 1=16
Concat                   cat_15                   2 1 249 250 252 0=0
Concat                   cat_16                   3 1 185 223 251 253 0=1
Reshape                  reshape_149              1 1 252 254 0=400 1=65
Concat                   cat_17                   3 1 188 226 254 255 0=1
Reshape                  reshape_150              1 1 253 256 0=8400 1=2 2=8
Slice                    split_8                  1 2 255 257 258 -23300=2,64,1 1=0
Reshape                  reshape_151              1 1 257 259 0=8400 1=16 2=4
Sigmoid                  sigmoid_84               1 1 258 260
Permute                  permute_143              1 1 259 261 0=2
MemoryData               /model.22/Constant_23_output_0 0 1 262 0=8400 1=2
Softmax                  softmax_142              1 1 261 263 0=0 1=1
MemoryData               /model.22/Constant_24_output_0 0 1 264 0=8400
BinaryOp                 mul_12                   1 1 256 265 0=2 1=1 2=2.0
Reshape                  reshape_152              1 1 262 266 0=8400 1=2 2=1
BinaryOp                 add_13                   2 1 265 266 267 0=0
Reshape                  reshape_153              1 1 264 268 0=8400 1=1 2=1
BinaryOp                 mul_14                   2 1 267 268 269 0=2
Convolution              conv_72                  1 1 263 270 0=1 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=0 6=16
Reshape                  reshape_154              1 1 269 271 0=8400 1=16
Reshape                  reshape_155              1 1 270 272 0=8400 1=4
Slice                    tensor_split_0           1 2 272 273 274 -23300=2,2,-233 1=0
MemoryData               /model.22/Constant_13_output_0 0 1 275 0=8400 1=2
BinaryOp                 sub_15                   2 1 275 273 276 0=1
Split                    splitncnn_26             1 2 276 277 278
MemoryData               /model.22/Constant_14_output_0 0 1 279 0=8400 1=2
BinaryOp                 add_16                   2 1 279 274 280 0=0
Split                    splitncnn_27             1 2 280 281 282
BinaryOp                 sub_17                   2 1 281 277 283 0=1
BinaryOp                 add_18                   2 1 278 282 284 0=0
BinaryOp                 div_19                   1 1 284 285 0=3 1=1 2=2.0
Concat                   cat_18                   2 1 285 283 286 0=0
MemoryData               /model.22/Constant_16_output_0 0 1 287 0=8400
Reshape                  reshape_156              1 1 287 288 0=8400 1=1
BinaryOp                 mul_20                   2 1 286 288 289 0=2
Concat                   cat_19                   3 1 289 260 271 output 0=0
